
// напишите программу, которая на вход принимает два числа и выдаёт, 
// какое число большее, а какое меньшее.


int a = -9;
int b = -3;
if (a > b)

    Console.WriteLine("a большее, b меньшее");

else  

    Console.WriteLine("a  меньшее, b большее");
